#### Terraform Format and Style 🖌``
#### Terraform Initialization ⚙️``
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

```

terraform
module.shared.data.terraform_remote_state.infrastructure_state: Reading...
module.shared.data.terraform_remote_state.infrastructure_state: Read complete after 1s

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
+/- create replacement and then destroy

Terraform will perform the following actions:

  # module.buckets.aws_s3_bucket_object.add_investment_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "add_investment_function_object" {
      ~ etag               = "621b8a22ec9502bb4308aa8ec187704d" -> "fa28d132d019a6c88035c19118834f34"
        id                 = "lambdas/demo/add_investment_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.add_scenario_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "add_scenario_function_object" {
      ~ etag               = "5424093d114a1a5d256aaa1aa1c48221" -> "ec165f3d278fa4edaeaaa010e2ca546b"
        id                 = "lambdas/demo/add_scenario_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.add_tag_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "add_tag_function_object" {
      ~ etag               = "d37aa28fe10affd6597048d430422763" -> "b249b0a6c53060a6e8f0e2038dfbe821"
        id                 = "lambdas/demo/add_tag_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.add_user_to_customer_group_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "add_user_to_customer_group_function_object" {
      ~ etag               = "95b1e1b805a9c699b72a3f96c1657769" -> "bef82d59f580dd4f7dfa6ef0ae823280"
        id                 = "lambdas/demo/add_user_to_customer_group_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.assign_company_permissions_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "assign_company_permissions_function_object" {
      ~ etag               = "52ea4ad2bdb38ac270f2b9db27be43f3" -> "b7dd4a4066183a335332aad93abcb9b1"
        id                 = "lambdas/demo/assign_company_permissions_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.authorize_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "authorize_function_object" {
      ~ etag               = "52a4ae73d7056dc89ba46ffd723eba0c" -> "bc0eb5710502f4f6808bbb491ece17c0"
        id                 = "lambdas/demo/authorize_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.change_company_publicly_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "change_company_publicly_function_object" {
      ~ etag               = "f60874f6fbc7fd96efdd174d3f58d8b8" -> "8b76f024106b8154f59d79d1705e46ac"
        id                 = "lambdas/demo/change_company_publicly_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.change_user_role_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "change_user_role_function_object" {
      ~ etag               = "2696d37ef32054ea5dca9cf2839603ae" -> "ea63f1c7eb1c0e246e2f98dd8c2aa206"
        id                 = "lambdas/demo/change_user_role_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.connect_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "connect_function_object" {
      ~ etag               = "f64866a7b0c8f36b07cd710b6e3ebd32" -> "5bf864e40133d4794eaf534a79c184ee"
        id                 = "lambdas/demo/connect.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.delete_company_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "delete_company_function_object" {
      ~ etag               = "19d33956a961cf121d92755cc1123df9" -> "41808bf5b54f5c0ea6fcb4f933aa0103"
        id                 = "lambdas/demo/delete_company_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.delete_scenarios_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "delete_scenarios_function_object" {
      ~ etag               = "c1eb43fac0e4d5c11835e7995bdc3328" -> "24813dc52249b09206b7e5fa84e05b1d"
        id                 = "lambdas/demo/delete_scenarios_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.delete_tags_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "delete_tags_function_object" {
      ~ etag               = "b4aa1bdc1adb4e38cfe1f8e3e7976cad" -> "31db56bdd6b6e2606bfff70a18e24a4b"
        id                 = "lambdas/demo/delete_tags_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.disconnect_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "disconnect_function_object" {
      ~ etag               = "cdb566769a31d6a0e0fc54ee9a223245" -> "e26b38ed10661d3f189b64961a598f52"
        id                 = "lambdas/demo/disconnect.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.download_comparison_vs_peers_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "download_comparison_vs_peers_function_object" {
      ~ etag               = "3182ffc9db3cb7f7879fca101d13f0b7" -> "ce623dd5b37cffa5f9275238c7cae952"
        id                 = "lambdas/demo/download_comparison_vs_peers_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.edit_modify_data_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "edit_modify_data_function_object" {
      ~ etag               = "b1a71d40862a9aa73be8e44bf8053702" -> "26e2c73e383bd463690e6f3de3433f7b"
        id                 = "lambdas/demo/edit_modify_data_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_all_companies_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_all_companies_function_object" {
      ~ etag               = "1b901c5086720d3cda501ff3adda2787" -> "cb82e20e535678649e7e39573e011ac3"
        id                 = "lambdas/demo/get_all_companies_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_all_public_companies_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_all_public_companies_function_object" {
      ~ etag               = "a115b7d0744cb59e243d4fb76ea0d2ec" -> "77c7526a07338bef8699b6ab0f74bc7a"
        id                 = "lambdas/demo/get_all_public_companies_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_all_ranges_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_all_ranges_function_object" {
      ~ etag               = "0e63ad05f17c3fea424be61a0b65c102" -> "ac6eb8bb20db13ae335abeee1bc9e3c2"
        id                 = "lambdas/demo/get_all_ranges_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_all_tags_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_all_tags_function_object" {
      ~ etag               = "dbb8b31252926908707ba281e89946af" -> "a1254d3d8b5b9309cd379a138cd97fd7"
        id                 = "lambdas/demo/get_all_tags_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_by_metric_report_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_by_metric_report_function_object" {
      ~ etag               = "44918046a528cf76bfd230b91c8571e2" -> "6404ed31fec58d96e56379b68c3d9034"
        id                 = "lambdas/demo/get_by_metric_report_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_company_details_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_company_details_function_object" {
      ~ etag               = "c2d7a0105e4edbc3397f1200ccd84160" -> "1fbf54ce4cda4544fcf159d803bb9089"
        id                 = "lambdas/demo/get_company_details_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_company_investments_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_company_investments_function_object" {
      ~ etag               = "93930cd5d6ca05832af6b512a1245100" -> "4e7df9953d061e78cc583b4c58138df5"
        id                 = "lambdas/demo/get_company_investments_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_company_permissions_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_company_permissions_function_object" {
      ~ etag               = "e8ab3d2a8a7da8e551e02d2639547fe3" -> "0b20f4be5af4e7bfe550d45c611bd00c"
        id                 = "lambdas/demo/get_company_permissions_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_company_report_vs_peers_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_company_report_vs_peers_function_object" {
      ~ etag               = "c2c293382343b9396d79c31cb9808b75" -> "0d02b6b58574f27bd389c62d98a74b26"
        id                 = "lambdas/demo/get_company_report_vs_peers_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_comparison_vs_peers_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_comparison_vs_peers_function_object" {
      ~ etag               = "b705fd85cf6129aa5cf0b3a32cd4eb12" -> "1454e38360630433f83ffdca78c647af"
        id                 = "lambdas/demo/get_comparison_vs_peers_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_dynamic_report_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_dynamic_report_function_object" {
      ~ etag               = "5b91121117d40e14f8d4638f6e9eb349" -> "0e5a4efd6e5c6c55d9d17f8ec97dabac"
        id                 = "lambdas/demo/get_dynamic_report_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_edit_modify_data_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_edit_modify_data_function_object" {
      ~ etag               = "e38c7b45e6a6f4820b8c96ce3a3bc337" -> "e1dac592afe6b46450fb87956a767a3e"
        id                 = "lambdas/demo/get_edit_modify_data_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_investment_date_report_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_investment_date_report_function_object" {
      ~ etag               = "29243f5f5843e7091cee4ec4abe371b2" -> "ce47f2dea0c1c52f54bd69636b75151b"
        id                 = "lambdas/demo/get_investment_date_report_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_metric_types_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_metric_types_function_object" {
      ~ etag               = "ecd8b269323e1254e1f63a66a751b0c1" -> "4f0951967d84b59e16fc12b5844d25b3"
        id                 = "lambdas/demo/get_metric_types_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_ranges_by_metric_function_object will be created
  + resource "aws_s3_bucket_object" "get_ranges_by_metric_function_object" {
      + acl                    = "private"
      + bucket                 = "kpinetwork-backend"
      + bucket_key_enabled     = (known after apply)
      + content_type           = (known after apply)
      + etag                   = "522187c235eac0223f3a415fcca8c409"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "lambdas/demo/get_ranges_by_metric_handler.zip"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "buckets/../../dist/get_ranges_by_metric_handler.zip"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # module.buckets.aws_s3_bucket_object.get_roles_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_roles_function_object" {
      ~ etag               = "0b78c3de9821132b61332dadda7684c2" -> "331332d50f54dfb0f61d305ae8173f00"
        id                 = "lambdas/demo/get_roles_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_tags_by_company_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_tags_by_company_function_object" {
      ~ etag               = "f2adf0fe95a27f563b2d8a184b4bb783" -> "37bf3afd79dc080a20eb67a1f778d6fd"
        id                 = "lambdas/demo/get_tags_by_company_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_universe_overview_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_universe_overview_function_object" {
      ~ etag               = "41d203f4cf57735aecd25dbce21b4a54" -> "8484389ed9c0d2862918cd50506f3462"
        id                 = "lambdas/demo/get_universe_overview_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_user_details_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_user_details_function_object" {
      ~ etag               = "4565ac8989d532d0caeb93af3bc65f98" -> "aeebc7fe1c5079bba890ab87ee5dda2d"
        id                 = "lambdas/demo/get_user_details_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_users_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_users_function_object" {
      ~ etag               = "dd508c6953c3e341c43d365a680947f7" -> "17dfc004e0c22e375e985e627e8b71f5"
        id                 = "lambdas/demo/get_users_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.glue_trigger_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "glue_trigger_function_object" {
      ~ etag               = "1ec55e77898b97bab33678f4eba44b3b" -> "0a91c5eaeff5d004f6830c93004b8b29"
        id                 = "lambdas/demo/glue_trigger_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.layer_libraries_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "layer_libraries_object" {
      ~ etag               = "c1b037a09f95d7949a3bb715d99563d0" -> "68847d69403e3bde58431d0bf6702155"
        id                 = "layer/demo/layer_libraries.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.message_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "message_function_object" {
      ~ etag               = "02f8b9a079a2a071270c8423b3dea05a" -> "8027b036a6b21164d09d9b71d2452d6f"
        id                 = "lambdas/demo/message.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.register_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "register_function_object" {
      ~ etag               = "516996bcd57de1bad7cf6726f2734256" -> "2a723d9f9d5562d767551d733b3c9d86"
        id                 = "lambdas/demo/register.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.update_data_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "update_data_function_object" {
      ~ etag               = "e7a6869d52619df0360ab52e2c265c5a" -> "b1fc01492d6fa70886863740515c1e60"
        id                 = "lambdas/demo/update_data.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.update_tags_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "update_tags_function_object" {
      ~ etag               = "da34dfa8d313cea45c25e27c368ce6e7" -> "058dc1472e0e04716532d9afd65dfd66"
        id                 = "lambdas/demo/update_tags_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.upload_file_s3_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "upload_file_s3_function_object" {
      ~ etag               = "b9f1aeb6e8a7524befa4ca2bc5c01963" -> "f5a1ade52430ebadb4d95f77591ed4a1"
        id                 = "lambdas/demo/upload_file_s3_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.validate_data_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "validate_data_function_object" {
      ~ etag               = "51098d30771485c8ac65ee9710199fc6" -> "9b5ffc551c34980b66616462b75f698c"
        id                 = "lambdas/demo/validate_data_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.verify_users_with_same_email_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "verify_users_with_same_email_function_object" {
      ~ etag               = "36e1b8285241d52c30b537d6ecfbf969" -> "f774aa35f2723cbf13611d6dc76cae1b"
        id                 = "lambdas/demo/verify_users_with_same_email_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.functions.aws_lambda_function.add_investment_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "add_investment_lambda_function" {
        id                             = "demo_add_investment_lambda_function"
      ~ last_modified                  = "2022-11-07T19:03:26.000+0000" -> (known after apply)
      ~ source_code_hash               = "GpxlRW6erNNgGyVi7nHngR54P61qX3oNrOtoZ5L0nAk=" -> "gZfUuOipRvhpi8O7bsGk4rLHdmPIUOr3szDe3ba3hTA="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.add_scenario_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "add_scenario_lambda_function" {
        id                             = "demo_add_scenario_lambda_function"
      ~ last_modified                  = "2022-11-07T19:03:05.000+0000" -> (known after apply)
      ~ source_code_hash               = "ACaQ2iA/Uf9O8umY1avcleE/j/emfJcTMDNx5VWJT2I=" -> "ankFRsy3TcccZPKC/nrky1qtaSVqJEVoONk+DKn2p1A="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.add_tag_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "add_tag_lambda_function" {
        id                             = "demo_add_tag_lambda_function"
      ~ last_modified                  = "2022-11-07T19:03:15.000+0000" -> (known after apply)
      ~ source_code_hash               = "kM/yBDSuzXCA4kxMRxXQUBOS4X009ZvtgwuTmpBG6xg=" -> "AbURMCC2IdiKjS6vYtC9ilIls35LCcMAurR/aoG1YMg="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.add_user_to_customer_group_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "add_user_to_customer_group_lambda_function" {
        id                             = "demo_add_user_to_customer_group_lambda_function"
      ~ last_modified                  = "2022-11-07T19:03:27.000+0000" -> (known after apply)
      ~ source_code_hash               = "U7ZwrPsi1rDAzHH/5O4hGKHqKKXH9+iDO5B9KknOYTk=" -> "b0RtdJgo76TjknBdtB4ZQs0U16GjXYhnScBtFDqY5IU="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.assign_company_permissions_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "assign_company_permissions_lambda_function" {
        id                             = "demo_assign_company_permissions_lambda_function"
      ~ last_modified                  = "2022-11-07T19:03:29.000+0000" -> (known after apply)
      ~ source_code_hash               = "CTF/G0OKeMFi6U+8WfpQh+jRG+ciJf15ETWeOk+i7XA=" -> "6q2bJw/oD55QobCZzsH9WgfwFwGYR86WG6xjLPtCjAk="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.authorize_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "authorize_lambda_function" {
        id                             = "demo_authorize_lambda_function"
      ~ last_modified                  = "2022-11-07T19:03:09.000+0000" -> (known after apply)
      ~ source_code_hash               = "LuTKy9xT3dHmtW8ZF+u0eceVZla/ioMqowgajaBOZYc=" -> "pY54C+2wQT11uqKwnf2xVwb7YZs+ClD84EfF7p4XxAE="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.change_company_publicly_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "change_company_publicly_lambda_function" {
        id                             = "demo_change_company_publicly_lambda_function"
      ~ last_modified                  = "2022-11-07T19:03:36.000+0000" -> (known after apply)
      ~ source_code_hash               = "CKw6FT/s+ne8gXKu52AtntKlN9szJaZpZq3Tu6teU7U=" -> "u68hrNJJd4PR+c9krzCzyffnqOR0tkNieFdvg+iQGhY="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.change_user_role_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "change_user_role_lambda_function" {
        id                             = "demo_change_user_role_lambda_function"
      ~ last_modified                  = "2022-11-07T19:02:54.000+0000" -> (known after apply)
      ~ source_code_hash               = "IaeTVM6O62ehj3qpc8L/9TSibB7sAXRkkgngq0nH4BU=" -> "mUWoKjMA9SpLylwKuZuJgNnptYiC9gHY83L7bZM16lY="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.connect_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "connect_lambda_function" {
        id                             = "demo_connect_lambda_function"
      ~ last_modified                  = "2022-11-07T19:02:52.000+0000" -> (known after apply)
      ~ source_code_hash               = "aYXUc4ckpLYEsSZ5iWsdx3F7hXYUEntUYmw15po2fw8=" -> "j283PJ+fDGSJ4HP6W0OAxN9/fruHufDRKAMh8TGBDK8="
        tags                           = {}
        # (18 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.functions.aws_lambda_function.delete_company_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "delete_company_lambda_function" {
        id                             = "demo_delete_company_lambda_function"
      ~ last_modified                  = "2022-11-07T19:03:26.000+0000" -> (known after apply)
      ~ source_code_hash               = "Oa/fr3Nqq6+j+F8ePTbZZygqnQ10xTRN11u7+oh8vbw=" -> "JgIUU6OURL3+iQ6dNSedS4X5eNlt3wDyEOo7KbyDWuY="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.delete_scenarios_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "delete_scenarios_lambda_function" {
        id                             = "demo_delete_scenarios_lambda_function"
      ~ last_modified                  = "2022-11-07T19:02:54.000+0000" -> (known after apply)
      ~ source_code_hash               = "Irl/CJoO/LlAXowQ/E41y8RPjTthuAD6RWYynIWGi0U=" -> "i+MSB19//cUgo7ZfKtAKOljneHoczoztSZHkAu2VAcU="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.delete_tags_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "delete_tags_lambda_function" {
        id                             = "demo_delete_tags_lambda_function"
      ~ last_modified                  = "2022-11-07T19:03:17.000+0000" -> (known after apply)
      ~ source_code_hash               = "fCj2EXa0Y2ZeUAm51ZOOmyF9Gue9DOsv6VLdrblfv5I=" -> "F4Fs6BteC38v2BfpoJOTUryQCf5bMAGJFQuzp+dil+c="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.disconnect_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "disconnect_lambda_function" {
        id                             = "demo_disconnect_lambda_function"
      ~ last_modified                  = "2022-11-07T19:03:31.000+0000" -> (known after apply)
      ~ source_code_hash               = "MCCkz5HPRlTsspYOkEVrrXtH4iSbNvhkLkUDMkB4Uh4=" -> "FoeqWSkbBtb5P9zx3uB7OLsobvjP7WI1NIem7IjBZdU="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.download_comparison_vs_peers_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "download_comparison_vs_peers_lambda_function" {
        id                             = "demo_download_comparison_vs_peers_lambda_function"
      ~ last_modified                  = "2022-11-07T19:02:56.000+0000" -> (known after apply)
      ~ source_code_hash               = "uFLWVgTV6MV5YuJHMx7wndJ4nfplNKvXWB4Txeqwr8g=" -> "K+yWj+lL15bm88Qk2LDLSOwCYvfGfbfsL5LW4jNBK5Y="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.edit_modify_data_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "edit_modify_data_lambda_function" {
        id                             = "demo_edit_modify_data_lambda_function"
      ~ last_modified                  = "2022-11-07T19:03:34.000+0000" -> (known after apply)
      ~ source_code_hash               = "60SCU1tadnttLvhqxwWfj36SeXRmVVlVGHjvrWgEVFU=" -> "+oZXLPLxNGgaVwS50aCirewBFCA+IXT3paeN9cGjLUY="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_all_companies_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_all_companies_lambda_function" {
        id                             = "demo_get_all_companies_lambda_function"
      ~ last_modified                  = "2022-11-07T19:02:54.000+0000" -> (known after apply)
      ~ source_code_hash               = "6A2A4xUnKzS4vq7bdnlcenIjr/v+/X/1ypyeZUkdOTA=" -> "8S1K+3KHCTHj5VhGGHCCEtYGVws5TWrxHYlLBa45L7Y="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_all_public_companies_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_all_public_companies_lambda_function" {
        id                             = "demo_get_all_public_companies_lambda_function"
      ~ last_modified                  = "2022-11-07T19:03:28.000+0000" -> (known after apply)
      ~ source_code_hash               = "CZCIVTWH6TU8VbMld8PT2K9tjUT68ddSrs93RIYq7c4=" -> "JQD4rpuPz5jCRh0au1EdiFt/iHWLTRyQi3UuYkOhG8k="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_all_ranges_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_all_ranges_lambda_function" {
        id                             = "demo_get_all_ranges_lambda_function"
      ~ last_modified                  = "2022-11-07T19:03:04.000+0000" -> (known after apply)
      ~ source_code_hash               = "xqQvAZCNGviCNhhWQs+Ddt38xBftIGZNA7OQ9z7Spu0=" -> "6Uh3LfQ5MX5N7L/DiTtjfQqqwwM03C10YTZA2FIn/yw="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_all_tags_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_all_tags_lambda_function" {
        id                             = "demo_get_all_tags_lambda_function"
      ~ last_modified                  = "2022-11-07T19:03:21.000+0000" -> (known after apply)
      ~ source_code_hash               = "GwwEWm8Ax8qmSILT+YrlgoOWjLp9s66R847uc32X2wE=" -> "jiK67760ulpB3GXtdQgSK84l9i+OuHzGHTs2Ye79o44="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_by_metric_report_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_by_metric_report_lambda_function" {
        id                             = "demo_get_by_metric_report_lambda_function"
      ~ last_modified                  = "2022-11-07T19:03:06.000+0000" -> (known after apply)
      ~ source_code_hash               = "1AmHcMetcH9+3772BRRUgNSetfqmUH8LuqPY0iZOPl4=" -> "kovsZkFRC8/RC3mPw6xm09btRr+axpFMp4bB6yn3+vk="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_company_details_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_company_details_lambda_function" {
        id                             = "demo_get_company_details_lambda_function"
      ~ last_modified                  = "2022-11-07T19:03:28.000+0000" -> (known after apply)
      ~ source_code_hash               = "znyrl9PGbiJ5nAJN6bd2OqbhaOCd7EZl86NNjDEKmRU=" -> "kH3VvJtsNXaQWysCGgbj5MMSymnkMZ6dnThCdpL3egE="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_company_investments_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_company_investments_lambda_function" {
        id                             = "demo_get_company_investments_lambda_function"
      ~ last_modified                  = "2022-11-07T19:02:54.000+0000" -> (known after apply)
      ~ source_code_hash               = "V5GVH+qta6CXJFbaTAJp0v6aLPGeGtfNlIjMeRAEnMU=" -> "Be0N7wWPew3/HHsZnmenCeCSpwPkmMWL+XGdqAF4AkI="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_company_permissions_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_company_permissions_lambda_function" {
        id                             = "demo_get_company_permissions_lambda_function"
      ~ last_modified                  = "2022-11-07T19:03:07.000+0000" -> (known after apply)
      ~ source_code_hash               = "q1+Nv5Wre9wCCPPQxjrNX3qFtOX6yM7EizCGfqRnAI0=" -> "Z0P5JvRAnANpASukUSTq+jcxnaH7p0MDx/S6SDnA40M="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_company_report_vs_peers_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_company_report_vs_peers_lambda_function" {
        id                             = "demo_get_company_report_vs_peers_lambda_function"
      ~ last_modified                  = "2022-11-07T19:03:04.000+0000" -> (known after apply)
      ~ source_code_hash               = "vd0Jd0w1AVhuW7TFBYGs0m1Ws7tq3Q38uuaLFqK17js=" -> "v1Qp9RxakJ2a+0l70kIwimXmm48vsMNnzPf0FielqwY="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_comparison_vs_peers_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_comparison_vs_peers_lambda_function" {
        id                             = "demo_get_comparison_vs_peers_lambda_function"
      ~ last_modified                  = "2022-11-07T19:03:04.000+0000" -> (known after apply)
      ~ source_code_hash               = "Zj0cKzxRnr/DFc+npcDwx6UpMXq9PpdlUgAngWLk/0k=" -> "m/xgTrTqxtCHTThy2wsDAoSZB+fPgOqXDXhO1njV7Fg="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_dynamic_report_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_dynamic_report_lambda_function" {
        id                             = "demo_get_dynamic_report_lambda_function"
      ~ last_modified                  = "2022-11-07T19:03:05.000+0000" -> (known after apply)
      ~ source_code_hash               = "5/Y3dOPVPatsRc0OdRBCoLAmHw3ZdXVNtQDRMhxNPVI=" -> "m5CAtcmjEMgS0ZUgb6LYEYOc7SXpn19AwM0GFoRaZoM="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_edit_modify_data_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_edit_modify_data_lambda_function" {
        id                             = "demo_get_edit_modify_data_lambda_function"
      ~ last_modified                  = "2022-11-07T19:02:54.000+0000" -> (known after apply)
      ~ source_code_hash               = "GLi186NY01em5Y/mAYTNV4mcrFNMCbZJ1qOt/2+gPQg=" -> "uQzao3Z5SGxRbArZ5o9W1LI4ODrbNSVsLFQKl3rtjIo="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_investment_date_report_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_investment_date_report_lambda_function" {
        id                             = "demo_get_investment_date_report_lambda_function"
      ~ last_modified                  = "2022-11-07T19:02:57.000+0000" -> (known after apply)
      ~ source_code_hash               = "GbZ2EcJ7HmGxddiSvRHLSSisyf67066kyLC+aifDrD0=" -> "WbGhRyDQVxh9LX0XekWr0nk9+VyUWkju//CqSmw0gUc="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_metric_types_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_metric_types_lambda_function" {
        id                             = "demo_get_metric_types_lambda_function"
      ~ last_modified                  = "2022-11-07T19:03:15.000+0000" -> (known after apply)
      ~ source_code_hash               = "iRVuFcYztVf3ijIh/8+RS0W+2cnmVd/I8ulm2jPMxyU=" -> "TkZwRGG7yaJQGqtYYzhhB89R0s0sefdg/ICAT6EHk0s="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_ranges_by_metric_lambda_function will be created
  + resource "aws_lambda_function" "get_ranges_by_metric_lambda_function" {
      + arn                            = (known after apply)
      + function_name                  = "demo_get_ranges_by_metric_lambda_function"
      + handler                        = "get_ranges_by_metric_handler.handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + layers                         = [
          + "arn:aws:lambda:us-west-2:435552912911:layer:demo_db_lambda_layer:22",
        ]
      + memory_size                    = 128
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + runtime                        = "python3.8"
      + s3_bucket                      = "kpinetwork-backend"
      + s3_key                         = "lambdas/demo/get_ranges_by_metric_handler.zip"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + source_code_hash               = "gvsJMiGzJrtSsb2v6JpKY4D4kEbcYdD5u+86ungOEWo="
      + source_code_size               = (known after apply)
      + tags_all                       = (known after apply)
      + timeout                        = 100
      + version                        = (known after apply)

      + environment {
          + variables = {
              + "ACCESS_KEY"   = (sensitive)
              + "DB_HOST"      = (sensitive)
              + "DB_NAME"      = "demokpinetworkdb"
              + "DB_PASSWORD"  = (sensitive)
              + "DB_USERNAME"  = (sensitive)
              + "SECRET_KEY"   = (sensitive)
              + "USER_POOL_ID" = "us-west-2_usXw4S12D"
            }
        }

      + tracing_config {
          + mode = (known after apply)
        }

      + vpc_config {
          + security_group_ids = [
              + "sg-0bda66e4a9afc62a9",
            ]
          + subnet_ids         = [
              + "subnet-0264422b45299167e",
            ]
          + vpc_id             = (known after apply)
        }
    }

  # module.functions.aws_lambda_function.get_roles_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_roles_lambda_function" {
        id                             = "demo_get_roles_lambda_function"
      ~ last_modified                  = "2022-11-07T19:03:18.000+0000" -> (known after apply)
      ~ source_code_hash               = "o45RpGVmhxjSgFRJou2gS6L+ipIvDlB1ANUvsOrPI7s=" -> "MMLlTRo/38n3SJlcbLAEoZWBcLu/1ME/3uXT/jIrGj8="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_tags_by_company_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_tags_by_company_lambda_function" {
        id                             = "demo_get_tags_by_company_lambda_function"
      ~ last_modified                  = "2022-11-07T19:03:15.000+0000" -> (known after apply)
      ~ source_code_hash               = "wKsQQRPpj2yPogI8vThZ6SqXuWAvGYdRGlGWv2xnRr8=" -> "9LUuSE5Ttb8lBPDhag16SvqPJvN2g8o8FqIVk8bz/Zw="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_universe_overview_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_universe_overview_lambda_function" {
        id                             = "demo_get_universe_overview_lambda_function"
      ~ last_modified                  = "2022-11-07T19:03:26.000+0000" -> (known after apply)
      ~ source_code_hash               = "/s+gA83DnAgzhpVlu4LkeGnPlLGGH3skxQHB5lM2/Bo=" -> "V5pf3TaLoEKYgQZ8WHGM3kR6llt/61s8SnEDzam6q7E="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_user_details_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_user_details_lambda_function" {
        id                             = "demo_get_user_details_lambda_function"
      ~ last_modified                  = "2022-11-07T19:02:57.000+0000" -> (known after apply)
      ~ source_code_hash               = "aCmtwKuv5CnUAm+fr6GLcJMLjsgOSlEIxT8xobMNAUw=" -> "GY0V9lTwifLxsQS8hDe3PIQ+AaYuIfbjSFtkZD8ilx8="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_users_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_users_lambda_function" {
        id                             = "demo_get_users_lambda_function"
      ~ last_modified                  = "2022-11-07T19:02:54.000+0000" -> (known after apply)
      ~ source_code_hash               = "TSj12fp06ujnAgMB8VODrORirMe4Y/3Rvd6Bl2JWHRA=" -> "+Wv1dOMlgjXsX9QANHdnbcCoFSHMjTkFNKKJnNBC8i0="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.glue_trigger_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "glue_trigger_lambda_function" {
        id                             = "demo_glue_trigger_lambda_function"
      ~ last_modified                  = "2022-11-07T19:03:18.000+0000" -> (known after apply)
      ~ source_code_hash               = "6qPuauwQy7mEuk7rxNKGm5eQW1ysR0Gm426WhKOz39A=" -> "S/aGreKJIB6j/DPaoxxGTuSsgQXvGuflCTPDeiFaW4Q="
        tags                           = {}
        # (18 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.message_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "message_lambda_function" {
        id                             = "demo_message_lambda_function"
      ~ last_modified                  = "2022-11-07T19:03:15.000+0000" -> (known after apply)
      ~ source_code_hash               = "jXL27f678LVKTCY/FkyGKjUjBayAK1S6bl+IKnuTNDg=" -> "xAqVqq2ivd19F7q4kf7IXkatdUhh++Jg5+BQz+rszFU="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.register_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "register_lambda_function" {
        id                             = "demo_register_lambda_function"
      ~ last_modified                  = "2022-11-07T19:03:06.000+0000" -> (known after apply)
      ~ source_code_hash               = "YA2Ldttnk21v6NaYOaRVmi1cFZDL4lbF53v/XBLU9so=" -> "nrcATFE05s/Pm2w8EKa1EezQp437SufK1E1k/R/zn8M="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.update_data_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "update_data_lambda_function" {
        id                             = "demo_update_data_lambda_function"
      ~ last_modified                  = "2022-11-07T19:03:02.000+0000" -> (known after apply)
      ~ source_code_hash               = "i6Y284eIOjf/kakPuxvPpL1nwqrry5qYnmapd1n5bBE=" -> "wJ6//H4FlYT6XkWBRvSzbtm52w5+duQx6ue4etBuRfo="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.update_tags_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "update_tags_lambda_function" {
        id                             = "demo_update_tags_lambda_function"
      ~ last_modified                  = "2022-11-07T19:03:19.000+0000" -> (known after apply)
      ~ source_code_hash               = "5LtDCYQPOLxqt8NWFiwNgST/pn/QTkvP2Tq05JgjDbw=" -> "oXXos/113L549JFuTwKkHsnb3yU16b7TGN6ZFnNyLak="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.upload_file_s3_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "upload_file_s3_lambda_function" {
        id                             = "demo_upload_file_s3_lambda_function"
      ~ last_modified                  = "2022-11-07T19:03:31.000+0000" -> (known after apply)
      ~ source_code_hash               = "6SN/Ks2wG39i4GWwAyvbWiKBUnGtQqPJLE+CPOxK35k=" -> "VWq8OiERBcaL/Exee+xzlZ+cyykQctzudJTQOyXRqrw="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.validate_data_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "validate_data_lambda_function" {
        id                             = "demo_validate_data_lambda_function"
      ~ last_modified                  = "2022-11-07T19:03:24.000+0000" -> (known after apply)
      ~ source_code_hash               = "6xHUmuMOMZhQdH0w7uuc8X2cm8YJx3VWDT9J2rWIo7g=" -> "lU1omoJcrD/JvIaw8jZSt++NanYh03Y02GV3cHV6ku0="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.verify_users_with_same_email_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "verify_users_with_same_email_lambda_function" {
        id                             = "demo_verify_users_with_same_email_lambda_function"
      ~ last_modified                  = "2022-11-07T19:03:13.000+0000" -> (known after apply)
      ~ source_code_hash               = "4wCcTXyQzRDBLrwWFntfCy6ZYDplzV8bmGkLsuVLgaI=" -> "tF84DGk9sd+Bm8y+femicPFpWbrnQoJNDgFb42puKvE="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.gateway_deployment.aws_api_gateway_deployment.gateway_deployment must be replaced
+/- resource "aws_api_gateway_deployment" "gateway_deployment" {
      ~ created_date      = "2022-11-07T19:02:51Z" -> (known after apply)
      ~ execution_arn     = "arn:aws:execute-api:us-west-2:435552912911:kb7gblbu69/demo" -> (known after apply)
      ~ id                = "99awu9" -> (known after apply)
      ~ invoke_url        = "https://kb7gblbu69.execute-api.us-west-2.amazonaws.com/demo" -> (known after apply)
      ~ stage_description = "Deployed at 2022-11-07T19:02:51Z" -> (known after apply) # forces replacement
        # (2 unchanged attributes hidden)
    }

  # module.logs.aws_cloudwatch_log_group.get_ranges_by_metric_lambda_function will be created
  + resource "aws_cloudwatch_log_group" "get_ranges_by_metric_lambda_function" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + name              = "/aws/lambda/demo_get_ranges_by_metric_lambda_function"
      + retention_in_days = 14
      + tags_all          = (known after apply)
    }

  # module.network.aws_api_gateway_integration.get_ranges_by_metric_integration will be created
  + resource "aws_api_gateway_integration" "get_ranges_by_metric_integration" {
      + cache_namespace         = (known after apply)
      + connection_type         = "INTERNET"
      + http_method             = "GET"
      + id                      = (known after apply)
      + integration_http_method = "POST"
      + passthrough_behavior    = (known after apply)
      + resource_id             = (known after apply)
      + rest_api_id             = "kb7gblbu69"
      + timeout_milliseconds    = 29000
      + type                    = "AWS_PROXY"
      + uri                     = (known after apply)
    }

  # module.network.aws_api_gateway_method.get_ranges_by_metric_method will be created
  + resource "aws_api_gateway_method" "get_ranges_by_metric_method" {
      + api_key_required   = false
      + authorization      = "CUSTOM"
      + authorizer_id      = "3y14fs"
      + http_method        = "GET"
      + id                 = (known after apply)
      + request_parameters = {
          + "method.request.querystring.limit"  = false
          + "method.request.querystring.offset" = false
        }
      + resource_id        = (known after apply)
      + rest_api_id        = "kb7gblbu69"
    }

  # module.network.aws_api_gateway_resource.ranges_by_metric will be created
  + resource "aws_api_gateway_resource" "ranges_by_metric" {
      + id          = (known after apply)
      + parent_id   = "xqe34y"
      + path        = (known after apply)
      + path_part   = "{metric}"
      + rest_api_id = "kb7gblbu69"
    }

  # module.network.aws_apigatewayv2_deployment.deploy will be updated in-place
  ~ resource "aws_apigatewayv2_deployment" "deploy" {
      ~ description   = "Deployed at 2022-11-07T19:02:50Z" -> (known after apply)
        id            = "ey3sgf"
        # (2 unchanged attributes hidden)
    }

  # module.network.aws_apigatewayv2_stage.stage will be updated in-place
  ~ resource "aws_apigatewayv2_stage" "stage" {
        id              = "demo"
        name            = "demo"
        tags            = {}
        # (8 unchanged attributes hidden)

      - access_log_settings {
          - destination_arn = "arn:aws:logs:us-west-2:435552912911:log-group:testing_websocket_api" -> null
          - format          = jsonencode(
                {
                  - caller       = "$context.identity.caller"
                  - connectionId = "$context.connectionId"
                  - eventType    = "$context.eventType"
                  - ip           = "$context.identity.sourceIp"
                  - requestId    = "$context.requestId"
                  - requestTime  = "$context.requestTime"
                  - routeKey     = "$context.routeKey"
                  - status       = "$context.status"
                  - user         = "$context.identity.user"
                }
            ) -> null
        }

        # (1 unchanged block hidden)
    }

  # module.policy.aws_iam_role.get_ranges_by_metric_lambda_exec_role will be created
  + resource "aws_iam_role" "get_ranges_by_metric_lambda_exec_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + description           = "Allows Lambda Function to call AWS services on your behalf."
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "demo_get_ranges_by_metric_lambda_exec_role"
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # module.policy.aws_iam_role_policy.get_ranges_by_metric_cognito_policy will be created
  + resource "aws_iam_role_policy" "get_ranges_by_metric_cognito_policy" {
      + id     = (known after apply)
      + name   = "demo_get_ranges_by_metric_cognito_policy"
      + policy = (sensitive)
      + role   = (known after apply)
    }

  # module.policy.aws_iam_role_policy_attachment.get_ranges_by_metric_lambda_logs will be created
  + resource "aws_iam_role_policy_attachment" "get_ranges_by_metric_lambda_logs" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::435552912911:policy/iam_policy_lambda_logging_function"
      + role       = "demo_get_ranges_by_metric_lambda_exec_role"
    }

  # module.policy.aws_iam_role_policy_attachment.get_ranges_by_metric_lambda_vpc will be created
  + resource "aws_iam_role_policy_attachment" "get_ranges_by_metric_lambda_vpc" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::435552912911:policy/iam_policy_lambda_network_function"
      + role       = "demo_get_ranges_by_metric_lambda_exec_role"
    }

  # module.policy.aws_lambda_permission.apigw_get_ranges_by_metric_lambda will be created
  + resource "aws_lambda_permission" "apigw_get_ranges_by_metric_lambda" {
      + action        = "lambda:InvokeFunction"
      + function_name = "demo_get_ranges_by_metric_lambda_function"
      + id            = (known after apply)
      + principal     = "apigateway.amazonaws.com"
      + source_arn    = (sensitive)
      + statement_id  = "AllowExecutionFromAPIGateway"
    }

Plan: 12 to add, 87 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didnt use the -out option to save this plan, so Terraform cant
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>

*Pusher: @kellycastrof, Action: `pull_request`*